#6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква. 

n=int(input('Введите число от 1 до 26: '))
n2=n+96
let=chr(n2)
print(let)